OpenFOAM/cough/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default        Gauss linear;
    div(phi,U)      Gauss GammaV 0.3;
    div(phi,s1)      Gauss Gamma 0.3;
    div(phi,h)       Gauss Gamma 0.3;

/*    div(phi,U)      Gauss upwind;
    div(phi,s1)      Gauss upwind;
    div(phi,h)       Gauss upwind;
*/    
    //div(phi,K)      Gauss Gamma 0.3;
    //div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


fluxRequired
{
    default         no;
    p_rgh;
}


// ************************************************************************* //
